
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВключитьВидимостьДополнительныхРеквизитов();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	ВключитьВидимостьДополнительныхРеквизитов();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВключитьВидимостьДополнительныхРеквизитов()
	
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание") Тогда
		Элементы.ВКМ_ГруппаДоработки.Видимость = Истина;
	Иначе
		Элементы.ВКМ_ГруппаДоработки.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
