#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	ДанныеОтпусков = Новый Массив;
	
	Для Каждого Отпуск Из ОтпускаСотрудников Цикл
	
		Если Месяц(Отпуск.ДатаНачала) = Месяц(Отпуск.ДатаОкончания) Тогда
			ИнформацияОбОтпуске = СформироватьИнформациюОбОтпуске(Отпуск.Сотрудник, Год(Год), Месяц(Отпуск.ДатаНачала),
																День(Отпуск.ДатаОкончания) - День(Отпуск.ДатаНачала));
			ДанныеОтпусков.Добавить(ИнформацияОбОтпуске);
		Иначе
			ДатаНачала = Отпуск.ДатаНачала;
			ДатаОкончания = Отпуск.ДатаОкончания;
			Пока Месяц(ДатаНачала) <> Месяц(ДатаОкончания) Цикл
				КонецМесяца = КонецМесяца(ДатаНачала);
				ИнформацияОбОтпуске = СформироватьИнформациюОбОтпуске(Отпуск.Сотрудник, Год(Год), Месяц(ДатаНачала),
																	День(КонецМесяца) - День(ДатаНачала) + 1);
				ДанныеОтпусков.Добавить(ИнформацияОбОтпуске);
				ДатаНачала = КонецМесяца + 1;
			КонецЦикла;
			ИнформацияОбОтпуске = СформироватьИнформациюОбОтпуске(Отпуск.Сотрудник, Год(Год), Месяц(ДатаНачала),
																День(ДатаОкончания) - День(ДатаНачала));	
			ДанныеОтпусков.Добавить(ИнформацияОбОтпуске);
		КонецЕсли;
		
	КонецЦикла;

	Движения.ВКМ_ЗапланированныеОтпуска.Записывать = Истина;
	
	Для Каждого Отпуск Из ДанныеОтпусков Цикл
	
		Движение = Движения.ВКМ_ЗапланированныеОтпуска.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = Отпуск.Сотрудник;
		Движение.Год = Отпуск.Год;
		Движение.Месяц = Отпуск.Месяц;
		Движение.КоличествоДнейОтпуска = Отпуск.КоличествоДнейОтпуска;
			
	КонецЦикла;
	
	Движения.ВКМ_ЗапланированныеОтпуска.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СформироватьИнформациюОбОтпуске(Сотрудник, Год, Месяц, КоличествоДнейОтпуска, Доп = 0)
	
	ИнформацияОбОтпуске = Новый Структура;
	ИнформацияОбОтпуске.Вставить("Сотрудник", Сотрудник);
	ИнформацияОбОтпуске.Вставить("Год", Год);
	ИнформацияОбОтпуске.Вставить("Месяц", Месяц);
	ИнформацияОбОтпуске.Вставить("КоличествоДнейОтпуска", КоличествоДнейОтпуска);
	
	Возврат ИнформацияОбОтпуске;
		
КонецФункции

#КонецОбласти

#КонецЕсли