#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	Записать();
	ЗаполнитьНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.Сотрудник,
	|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток
	|ИЗ
	|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(&Период,) КАК ВКМ_ВзаиморасчетыССотрудникамиОстатки";
	
	Запрос.УстановитьПараметр("Период", Объект.Дата);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Объект.Выплаты.Очистить();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяВыплата = Объект.Выплаты.Добавить();
		НоваяВыплата.Сотрудник = Выборка.Сотрудник;
		НоваяВыплата.Сумма = Выборка.СуммаОстаток;
			
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
