#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Для Каждого ТекСтрока Из СписокСотрудников Цикл
		
		Премия = ТекСтрока.СуммаПремии;
		НДФЛ = ТекСтрока.СуммаПремии * 13 / 100;
		
		Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;
		Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.Премия;
		Движение.ПериодРегистрации = Дата;
		Движение.Сотрудник = ТекСтрока.Сотрудник;
		Движение.Сумма = Премия;
		
		Движения.ВКМ_Удержания.Записывать = Истина;
		Движение = Движения.ВКМ_Удержания.Добавить();
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		Движение.ПериодРегистрации = Дата;
		Движение.Сотрудник = ТекСтрока.Сотрудник;
		Движение.Сумма = НДФЛ;
		Движение.Источник = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.Премия;
		Движение.БазовыйПериодНачало = НачалоМесяца(Дата);
		Движение.БазовыйПериодКонец = КонецМесяца(Дата);
		
		Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
		Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Сотрудник = ТекСтрока.Сотрудник;
		Движение.Сумма = Премия - НДФЛ;
			
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли